from models.Days import *
from models.Answer import Answer, KiloType

newWeekMenu = Week(
    days={
        WeekDay.MONDAY: Day(
            dayType=WeekDay.MONDAY,
            meals={
                MealType.BREAKFAST: Meal(
                    mealType=MealType.BREAKFAST,
                    answers=[
                        Answer(
                            imageSrc="images/monday/breakfast.jpg",
                            text={
                                KiloType.K_1300: """Яєшня зі шпинатом і помідором + хлібець із творогом
Яйця — 2 шт. 
Шпинат (свіжий або заморожений) — 70 г
Помідор 1шт.  — 60 г
Олія — 3 г
Творог 5% — 70 г + зелень
Хлібець цільнозерновий — 1 шт. (10 г)
Творог можна змішати із зеленню і намастити на хлібець""",
                                KiloType.K_1500: """Яєшня зі шпинатом і помідором + хлібець із творогом
Яйця — 2 шт. 
Шпинат (свіжий або заморожений) — 70 г
Помідор 1шт.  — 60 г
Олія — 3 г
Творог 5% — 100 г + зелень
Хлібець цільнозерновий — 3 шт. (30 г)
Творог можна змішати із зеленню і намастити на хлібець""",
                                KiloType.K_1700: """Яєшня зі шпинатом і помідором + хлібець із творогом
Яйця — 2 шт. 
Шпинат (свіжий або заморожений) — 70 г
Помідор 1шт.  — 60 г
Олія — 3 г
Творог 5% — 120 г + зелень
Хлібець цільнозерновий — 3 шт. (30 г)
Творог можна змішати із зеленню і намастити на хлібець""",
                            }
                        ),
                    ]
                ),
                MealType.MORNING_SNACK: Meal(
                    mealType=MealType.MORNING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/monday/morning_snack.jpg",
                            text={
                                KiloType.K_1300: """Домашній шоколадний ПП-мафін (1 порція)
Яйце — 1 шт.
Банан — 60 г
Какао — 5 г
Рисове борошно — 25 г
Йогурт натуральний 2% — 30 г
Розпушувач на кінчик ножа, ваніль — за бажанням
> Змішати інгредієнти, випікати у формі 20 хв при 180°C.""",
                                KiloType.K_1500: """Домашній шоколадний ПП-мафін (1 порція)
Яйце — 1 шт.
Банан — 60 г
Какао — 5 г
Рисове борошно — 25 г
Йогурт натуральний 2% — 30 г
Розпушувач на кінчик ножа, ваніль — за бажанням
> Змішати інгредієнти, випікати у формі 20 хв при 180°C.
Волоський горіх 10г""",
                                KiloType.K_1700: """Домашній шоколадний ПП-мафін (1 порція)
Яйце — 1 шт.
Банан — 60 г
Какао — 5 г
Рисове борошно — 25 г
Йогурт натуральний 2% — 30 г
Розпушувач на кінчик ножа, ваніль — за бажанням
> Змішати інгредієнти, випікати у формі 20 хв при 180°C.
Волоський горіх 15г""",
                            }
                        ),
                    ]
                ),
                MealType.LUNCH: Meal(
                    mealType=MealType.LUNCH,
                    answers=[
                        Answer(
                            imageSrc="images/monday/lunch.jpg",
                            text={
                                KiloType.K_1300: """Гречка з курячим філе і овочевим салатом
Гречка суха (вівсянка, булгур, кус-кус, пшоно,коричневий рис, перловка) — 40 г
Куряче філе в сирому виді 130-135г (готове 100 г)
Масло вершкове до каші — 5 г
Салат з огірка, капусти, зелені — 150 г
Олія для заправки — 3 г""",
                                KiloType.K_1500: """Гречка з курячим філе і овочевим салатом
Гречка суха  (вівсянка, булгур, кус-кус, пшоно,коричневий рис, перловка)  — 45 г
Куряче філе 160г-170г сирого (120 г в готовому виді)
Масло вершкове до каші — 5 г
Салат з огірка, капусти, зелені — 150 г
Олія для заправки — 3 г""",
                                KiloType.K_1700: """Гречка з курячим філе і овочевим салатом
Гречка суха  (вівсянка, булгур, кус-кус, пшоно, коричневий рис, перловка) — 50 г
Куряче філе 180г-185г сирого (130 г готового)
Масло вершкове до каші — 5 г
Салат з огірка, капусти, зелені — 150 г
Олія для заправки — 3 г""",
                            }
                        ),
                    ]
                ),
                MealType.EVENING_SNACK: Meal(
                    mealType=MealType.EVENING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/monday/evening_snack.jpg",
                            text={
                                KiloType.K_1300: """Йогурт + чорниця
Йогурт 2% без цукру — 100 г
Чорниця (або малина) — 60 г""",
                                KiloType.K_1500: """Йогурт + чорниця
Йогурт 2% без цукру — 150 г
Чорниця (або малина) — 70 г""",
                                KiloType.K_1700: """Йогурт + чорниця
Йогурт 2% без цукру — 170 г
Чорниця (або малина) — 80 г""",
                            }
                        ),
                    ]
                ),
                MealType.DINNER: Meal(
                    mealType=MealType.DINNER,
                    answers=[
                        Answer(
                            imageSrc="images/monday/dinner.jpg",
                            text={
                                KiloType.K_1300: """Кабачкові оладки з сиром
Кабачок — 200 г
Яйце — 1 шт.
Вівсяне/рисове борошно — 20 г
Сир твердий до 30% — 20 г
Олія — 3 г (для смажування або змащування форми)""",
                                KiloType.K_1500: """Кабачкові оладки з сиром
Кабачок — 200 г
Яйце — 1 шт.
Вівсяне/рисове борошно — 20 г
Сир твердий до 30% — 20 г
Олія — 3 г (для смажування або змащування форми)""",
                                KiloType.K_1700: """Кабачкові оладки з сиром
Кабачок — 200 г
Яйце — 1 шт.
Вівсяне/рисове борошно — 20 г
Сир твердий до 30% — 25 г
Олія — 3 г (для смажування або змащування форми)
Хлібець цільнозерновий 15г""",
                            }
                        ),
                    ]
                ),
            }
        ),
        WeekDay.TUESDAY: Day(
            dayType=WeekDay.TUESDAY,
            meals={
                MealType.BREAKFAST: Meal(
                    mealType=MealType.BREAKFAST,
                    answers=[
                        Answer(
                            imageSrc="images/tuesday/breakfast.jpg",
                            text={
                                KiloType.K_1300: """Ліниві вареники з малиною
Сир кисломолочний 5% — 150 г
Яєчний білок — 1 шт.
Рисове борошно — 30 г
Цукор — 10 г або замінник
Малина — 60 г
Приготування: змішуємо сир, цукор, білок, борошно, тісто має трішки липнути до рук, якщо рідкувате, додайте ще борошна, все залежить від сиру. Формуємо вареники кульками, в серединку кладемо 1 ягоду малини. Вкидаємо в киплячу воду, як тільки піднялися на поверхню, виймаємо.""",
                                KiloType.K_1500: """Ліниві вареники з малиною
Сир кисломолочний 5% — 200 г
Яєчний білок — 1 шт.
Рисове борошно — 40 г
Цукор — 10 г або замінник
Малина — 60 г
Приготування: змішуємо сир, цукор, білок, борошно, тісто має трішки липнути до рук, якщо рідкувате, додайте ще борошна, все залежить від сиру. Формуємо вареники кульками, в серединку кладемо 1 ягоду малини. Вкидаємо в киплячу воду, як тільки піднялися на поверхню, виймаємо.""",
                                KiloType.K_1700: """Ліниві вареники з малиною
Сир кисломолочний 5% — 250 г
Яєчний білок — 1 шт.
Рисове борошно — 45 г
Цукор — 10 г або замінник
Малина — 70 г
Приготування: змішуємо сир, цукор, білок, борошно, тісто має трішки липнути до рук, якщо рідкувате, додайте ще борошна, все залежить від сиру. Формуємо вареники кульками, в серединку кладемо 1 ягоду малини. Вкидаємо в киплячу воду, як тільки піднялися на поверхню, виймаємо.""",
                            }
                        ),
                    ]
                ),
                MealType.MORNING_SNACK: Meal(
                    mealType=MealType.MORNING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/tuesday/morning_snack.jpg",
                            text={
                                KiloType.K_1300: """Фрукти, ягоди сезонні — 150 г
Волоські горіхи — 10 г""",
                                KiloType.K_1500: """Цільнозерновий хлібець 15г
Арахісова паста 10г
Ягоди — 120 г""",
                                KiloType.K_1700: """Цільнозерновий хлібець 20г
Арахісова паста 15г
Ягоди — 150 г""",
                            }
                        ),
                    ]
                ),
                MealType.LUNCH: Meal(
                    mealType=MealType.LUNCH,
                    answers=[
                        Answer(
                            imageSrc="images/tuesday/lunch.jpg",
                            text={
                                KiloType.K_1300: """Салат «Серце гурмана» + хлібець
Курячі серця в сирому виді 115-125г (100 г відварені, нарізані)
Яйце — 1 шт.
Зелений горошок — 50 г
Огірок — 70 г
Заправка: сметана 10% — 15 г, гірчиця — ½ ч.л., зелень
Готуємо: серця почистити від зайвого, помити, відварити в підсоленій воді, нарізати шматочками.
Яйце відварити, ріжемо кубиком. Горошок бланшувати 5 хв. Огірок ріжемо кубиком. Змішуємо всі інгредієнти. Додаємо зелень за смаком, Мені тут смакує зелена цибуля та петрушка.
Заправляємо сметаною змішаною з гірчицею, солимо, перчимо, перемішуємо.
Хлібець цільнозерновий — 1 шт. (10 г)""",
                                KiloType.K_1500: """Салат «Серце гурмана» + хлібець
Курячі серця в сирому виді 140г- 145г (120 г відварені, нарізані)
Яйце — 1 шт.
Зелений горошок — 60 г
Огірок — 70 г
Заправка: сметана 10% — 15 г, гірчиця — ½ ч.л., зелень
Готуємо: серця почистити від зайвого, помити, відварити в підсоленій воді, нарізати шматочками.
Яйце відварити, ріжемо кубиком. Горошок бланшувати 5 хв. Огірок ріжемо кубиком. Змішуємо всі інгредієнти. Додаємо зелень за смаком, Мені тут смакує зелена цибуля та петрушка.
Заправляємо сметаною змішаною з гірчицею, солимо, перчимо, перемішуємо.
Хліб цільнозерновий — 30 г""",
                                KiloType.K_1700: """Салат «Серце гурмана» + хлібець
Курячі серця в сирому виді 130г-135г (130 г відварені, нарізані)
Яйце — 1 шт.
Зелений горошок — 60 г
Огірок — 80 г
Заправка: сметана 10% — 15 г, гірчиця — ½ ч.л., зелень
Готуємо: серця почистити від зайвого, помити, відварити в підсоленій воді, нарізати шматочками.
Яйце відварити, ріжемо кубиком. Горошок бланшувати 5 хв. Огірок ріжемо кубиком. Змішуємо всі інгредієнти. Додаємо зелень за смаком, Мені тут смакує зелена цибуля та петрушка.
Заправляємо сметаною змішаною з гірчицею, солимо, перчимо, перемішуємо.
Хліб цільнозерновий — 40 г""",
                            }
                        ),
                    ]
                ),
                MealType.EVENING_SNACK: Meal(
                    mealType=MealType.EVENING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/tuesday/evening_snack.jpg",
                            text={
                                KiloType.K_1300: """Кефір 2,5% — 250 мл
Хлібець цільнозерновий — 1 шт. (10 г)""",
                                KiloType.K_1500: """Банан 100г
Волоські горіхи 5г""",
                                KiloType.K_1700: """Банан 120г
Волоські горіхи 5г-7г
Йогурт 2% - 100г""",
                            }
                        ),
                    ]
                ),
                MealType.DINNER: Meal(
                    mealType=MealType.DINNER,
                    answers=[
                        Answer(
                            imageSrc="images/tuesday/dinner.jpg",
                            text={
                                KiloType.K_1300: """Овочеве соте з куркою
Куряче філе в сирому виді 110 г
Овочі (кабачок, перець, броколі, цибуля тощо) — 300 г
Олія — 5 г
Сіль, перець, спеції — за смаком
За бажанням: зелень, часник, сушений базилік або італійські трави
Приготування: куряче філе наріжте невеликими шматочками або смужками, кабачок та цибулю — наріжте півкільцями, перець — соломкою, броколі — розділіть на дрібні суцвіття.
У сковороді розігрійте 5 г олії, додайте курку, посоліть, поперчіть і обсмажуйте на середньому вогні 5–7 хв до напівготовності, періодично помішуючи.
Додайте до курки спочатку цибулю, обсмажте 1–2 хв. Потім додайте решту овочів (кабачок, перець, броколі). За бажанням — трохи води (2–3 ст. л.), щоб овочі м’якшали без зайвої олії.
Накрийте сковорідку кришкою й тушкуйте 10–12 хв на середньому вогні, поки овочі стануть м’якими, а курка — повністю готовою.
Додайте улюблені спеції, сушені трави чи зелень.""",
                                KiloType.K_1500: """Овочеве соте з куркою
Куряче філе в сирому виді 120 г
Овочі (кабачок, перець, броколі, цибуля тощо) — 300 г
Олія — 5 г
Сіль, перець, спеції — за смаком
За бажанням: зелень, часник, сушений базилік або італійські трави
Приготування: куряче філе наріжте невеликими шматочками або смужками, кабачок та цибулю — наріжте півкільцями, перець — соломкою, броколі — розділіть на дрібні суцвіття.
У сковороді розігрійте 5 г олії, додайте курку, посоліть, поперчіть і обсмажуйте на середньому вогні 5–7 хв до напівготовності, періодично помішуючи.
Додайте до курки спочатку цибулю, обсмажте 1–2 хв. Потім додайте решту овочів (кабачок, перець, броколі). За бажанням — трохи води (2–3 ст. л.), щоб овочі м’якшали без зайвої олії.
Накрийте сковорідку кришкою й тушкуйте 10–12 хв на середньому вогні, поки овочі стануть м’якими, а курка — повністю готовою.
Додайте улюблені спеції, сушені трави чи зелень.""",
                                KiloType.K_1700: """Овочеве соте з куркою
Куряче філе в сирому виді — 130 г
Овочі (кабачок, перець, броколі, цибуля тощо) — 350 г
Олія — 5 г
Сіль, перець, спеції — за смаком
За бажанням: зелень, часник, сушений базилік або італійські трави
Приготування: куряче філе наріжте невеликими шматочками або смужками, кабачок та цибулю — наріжте півкільцями, перець — соломкою, броколі — розділіть на дрібні суцвіття.
У сковороді розігрійте 5 г олії, додайте курку, посоліть, поперчіть і обсмажуйте на середньому вогні 5–7 хв до напівготовності, періодично помішуючи.
Додайте до курки спочатку цибулю, обсмажте 1–2 хв. Потім додайте решту овочів (кабачок, перець, броколі). За бажанням — трохи води (2–3 ст. л.), щоб овочі м’якшали без зайвої олії.
Накрийте сковорідку кришкою й тушкуйте 10–12 хв на середньому вогні, поки овочі стануть м’якими, а курка — повністю готовою.
Додайте улюблені спеції, сушені трави чи зелень.""",
                            }
                        ),
                    ]
                ),
            }
        ),
        WeekDay.WEDNESDAY: Day(
            dayType=WeekDay.WEDNESDAY,
            meals={
                MealType.BREAKFAST: Meal(
                    mealType=MealType.BREAKFAST,
                    answers=[
                        Answer(
                            imageSrc="images/wednesday/breakfast.jpg",
                            text={
                                KiloType.K_1300: """Сендвіч з авокадо і сиром
Цільнозерновий хліб — 60 г (2 скибки)
Авокадо — 40 г
Яйце — 1 шт. (50 г)
Сир твердий 20% — 30 г
Зелень свіжа — 10 г""",
                                KiloType.K_1500: """Сендвіч з авокадо і сиром
Цільнозерновий хліб — 70 г 
Авокадо — 45 г
Яйце — 1 шт. (50 г)
Сир твердий 20% — 30 г
Зелень свіжа — 10 г""",
                                KiloType.K_1700: """Сендвіч з авокадо і сиром
Цільнозерновий хліб — 80 г 
Авокадо — 50 г
Яйце — 1 шт. (50 г)
Сир твердий 20% — 35 г
Зелень свіжа — 10 г""",
                            }
                        ),
                    ]
                ),
                MealType.MORNING_SNACK: Meal(
                    mealType=MealType.MORNING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/wednesday/morning_snack.jpg",
                            text={
                                KiloType.K_1300: """фрукти + кефір
Фрукти або ягоди (яблуко, персик, чорниця) — 200 г
Кефір 1,5% — 200 мл""",
                                KiloType.K_1500: """фрукти + кефір
Фрукти або ягоди (яблуко, персик, чорниця) — 250 г
Кефір 1,5% — 200 мл""",
                                KiloType.K_1700: """фрукти + кефір
Фрукти або ягоди (яблуко, персик, чорниця) — 250 г
Кефір 1,5% — 250 мл
Насіння льону або чіа 5г""",
                            }
                        ),
                    ]
                ),
                MealType.LUNCH: Meal(
                    mealType=MealType.LUNCH,
                    answers=[
                        Answer(
                            imageSrc="images/wednesday/lunch.jpg",
                            text={
                                KiloType.K_1300: """Салат із капусти + курячі шлуночки у вершках
Салат:
Капуста білокачанна — 150 г
Морква — 50 г
Олія нерафінована — 5 г (1 ч.л.)
Шлуночки у вершках:
Курячі шлуночки в сирому виді — 150 г (або 120-130г курячі серця, куряча печінка, куряче філе)
Цибуля — 50 г
Вершки 10% — 60 мл
Олія — 5 г
Сіль, перець, кріп — за смаком
Готуємо: Курячі шлунки миємо, чистимо від жиру, ріжемо шматочками. На сковорідку додаємо 5мл олії, викладаємо шлуночки, смажимо 5 хв, додаємо цибулю, ще 5 хв, тоді доливаємо стакан води, тушимо на малому вогні до готовності, вливаємо вершки, тепер солимо, перчимо, тушкуємо ще 10хв. В самому кінці додаємо кріп.""",
                                KiloType.K_1500: """Салат із капусти + курячі шлуночки у вершках
Салат:
Капуста білокачанна — 150 г
Морква — 50 г
Олія нерафінована — 5 г (1 ч.л.)
Шлуночки у вершках:
Курячі шлуночки в сирому виді — 160 г (або 130-140г курячі серця, куряча печінка, куряче філе)
Цибуля — 60 г
Вершки 10% — 80 мл
Олія — 5 г
Сіль, перець, кріп — за смаком
Готуємо: Курячі шлунки миємо, чистимо від жиру, ріжемо шматочками. На сковорідку додаємо 5мл олії, викладаємо шлуночки, смажимо 5 хв, додаємо цибулю, ще 5 хв, тоді доливаємо стакан води, тушимо на малому вогні до готовності, вливаємо вершки, тепер солимо, перчимо, тушкуємо ще 10хв. В самому кінці додаємо кріп.""",
                                KiloType.K_1700: """Гречка варена 100г
Салат із капусти + курячі шлуночки у вершках
Салат:
Капуста білокачанна — 150 г
Морква — 50 г
Олія нерафінована — 5 г (1 ч.л.)
Шлуночки у вершках:
Курячі шлуночки в сирому виді — 170 г (або 140-150г курячі серця, куряча печінка, куряче філе)
Цибуля — 60 г
Вершки 10% — 90 мл
Олія — 5 г
Сіль, перець, кріп — за смаком
Готуємо: Курячі шлунки миємо, чистимо від жиру, ріжемо шматочками. На сковорідку додаємо 5мл олії, викладаємо шлуночки, смажимо 5 хв, додаємо цибулю, ще 5 хв, тоді доливаємо стакан води, тушимо на малому вогні до готовності, вливаємо вершки, тепер солимо, перчимо, тушкуємо ще 10хв. В самому кінці додаємо кріп.""",
                            }
                        ),
                    ]
                ),
                MealType.EVENING_SNACK: Meal(
                    mealType=MealType.EVENING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/wednesday/evening_snack.jpg",
                            text={
                                KiloType.K_1300: """Яйце + овочі
Яйце — 1 шт. (50 г)
Овочі (огірок, перець, томат) — 100 г""",
                                KiloType.K_1500: """Яйце + овочі
Яйце — 1 шт. (50 г)
Овочі (огірок, перець, томат) — 100 г
Сир твердий 10г
Хліб цільнозерновий 20г""",
                                KiloType.K_1700: """Яйце + овочі
Яйце — 1 шт. (50 г)
Овочі (огірок, перець, томат) — 100 г
Сир твердий 15г
Хліб цільнозерновий 30г""",
                            }
                        ),
                    ]
                ),
                MealType.DINNER: Meal(
                    mealType=MealType.DINNER,
                    answers=[
                        Answer(
                            imageSrc="images/wednesday/dinner.jpg",
                            text={
                                KiloType.K_1300: """Баклажани по-французьки
Баклажан — 200 г
Помідори — 100 г
Сметана 10–15% — 20 г
Твердий сир 20% — 20 г
Олія — 5 г
Часник — 1 зубок, спеції
Приготування: розігріваємо духовку до 180 градусів. Ріжемо баклажан пластинками, сметану змішуємо з вичавленим часником, сіллю, перцем, улюбленими спеціями. Викладаємо в форму баклажани, змащуємо їх сметаною зі спеціями, на кожну пластинку баклажану викладаємо помідори скибками чи кружальцями, притрушуємо тертим сиром. Запікаємо 20-25хв.""",
                                KiloType.K_1500: """Баклажани по-французьки
Баклажан — 200 г
Помідори — 100 г
Сметана 10–15% — 25 г
Твердий сир 20% — 25 г
Олія — 5 г
Часник — 1 зубок, спеції
Приготування: розігріваємо духовку до 180 градусів. Ріжемо баклажан пластинками, сметану змішуємо з вичавленим часником, сіллю, перцем, улюбленими спеціями. Викладаємо в форму баклажани, змащуємо їх сметаною зі спеціями, на кожну пластинку баклажану викладаємо помідори скибками чи кружальцями, притрушуємо тертим сиром. Запікаємо 20-25хв.""",
                                KiloType.K_1700: """Bаклажани по-французьки
Баклажан — 200 г
Помідори — 100 г
Сметана 10–15% — 30 г
Твердий сир 20% — 30 г
Олія — 5 г
Часник — 1 зубок, спеції
Приготування: розігріваємо духовку до 180 градусів. Ріжемо баклажан пластинками, сметану змішуємо з вичавленим часником, сіллю, перцем, улюбленими спеціями. Викладаємо в форму баклажани, змащуємо їх сметаною зі спеціями, на кожну пластинку баклажану викладаємо помідори скибками чи кружальцями, притрушуємо тертим сиром. Запікаємо 20-25хв.""",
                            }
                        ),
                    ]
                ),
            }
        ),
        WeekDay.THURSDAY: Day(
            dayType=WeekDay.THURSDAY,
            meals={
                MealType.BREAKFAST: Meal(
                    mealType=MealType.BREAKFAST,
                    answers=[
                        Answer(
                            imageSrc="images/thursday/breakfast.jpg",
                            text={
                                KiloType.K_1300: """Сирники в духовці + йогурт
Творог 5% — 120 г
Яйце — 1 шт. (50 г)
Борошно рисове/вівсяне — 20 г
Підсолоджувач або ваніль — за бажанням
Олія — 1 г (для змащування форми)
Йогурт 2% для подачі — 50 г""",
                                KiloType.K_1500: """Сирники в духовці + йогурт
Творог 5% — 130 г
Яйце — 1 шт. (50 г)
Борошно рисове/вівсяне — 25 г
Підсолоджувач або ваніль — за бажанням
Олія — 1 г (для змащування форми)
Йогурт 2% для подачі — 70 г""",
                                KiloType.K_1700: """Сирники в духовці + йогурт
Творог 5% — 150 г
Яйце — 1 шт. (50 г)
Борошно рисове/вівсяне — 25 г
Підсолоджувач або ваніль — за бажанням
Олія — 1 г (для змащування форми)
Йогурт 2% для подачі — 80 г""",
                            }
                        ),
                    ]
                ),
                MealType.MORNING_SNACK: Meal(
                    mealType=MealType.MORNING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/thursday/morning_snack.jpg",
                            text={
                                KiloType.K_1300: """Смузі з ківі, бананом і йогурту
Ківі — 70 г
Банан — 50 г
Йогурт 2% — 100 мл""",
                                KiloType.K_1500: """Смузі з ківі, бананом і йогуртом
Ківі — 80 г
Банан — 70 г
Йогурт 2% — 120 мл""",
                                KiloType.K_1700: """Смузі з ківі, бананом і йогуртом
Ківі — 100 г
Банан — 80 г
Йогурт 2% — 150 мл""",
                            }
                        ),
                    ]
                ),
                MealType.LUNCH: Meal(
                    mealType=MealType.LUNCH,
                    answers=[
                        Answer(
                            imageSrc="images/thursday/lunch.jpg",
                            text={
                                KiloType.K_1300: """Салат із буряком + суп гречаний з м’ясом
Салат:
Буряк — 100 г
Фета 45% — 15 г
Зелень — 10 г


Суп:
М’ясо варене — 80 г (110г-115г сирого)
Гречка сира — 25 г (дає ~55–60 г у вареному вигляді)
Картопля — 40 г
Цибуля + морква — 50 г (20 г + 30 г)
Масло вершкове — 5 г
Вода — 300–350 мл""",
                                KiloType.K_1500: """Салат із буряком + суп гречаний з м’ясом
Салат:
Буряк — 100 г
Фета 45% — 20 г
Зелень — 10 г


Суп:
М’ясо варене — 90 г (125г-130г сирого)
Гречка сира — 25 г (дає ~55–60 г у вареному вигляді)
Картопля — 40 г
Цибуля + морква — 50 г (20 г + 30 г)
Масло вершкове — 5 г
Вода — 300–350 мл""",
                                KiloType.K_1700: """Салат із буряком + суп гречаний з м’ясом
Салат:
Буряк — 100 г
Фета 45% — 25 г
Зелень — 10 г


Суп:
М’ясо варене — 100 г (130г-135г сирого)
Гречка сира — 25 г (дає ~55–60 г у вареному вигляді)
Картопля — 40 г
Цибуля + морква — 50 г (20 г + 30 г)
Масло вершкове — 5 г
Вода — 300–350 мл""",
                            }
                        ),
                    ]
                ),
                MealType.EVENING_SNACK: Meal(
                    mealType=MealType.EVENING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/thursday/evening_snack.jpg",
                            text={
                                KiloType.K_1300: """Сендвіч із сиром
Хліб цільнозерновий — 40 г
Сир твердий 20–25% — 20 г
Помідор або огірок — 50 г
Листя салату — 10 г""",
                                KiloType.K_1500: """Сендвіч із сиром
Хліб цільнозерновий — 50 г
Сир твердий 20–25% — 25 г
Помідор або огірок — 50 г
Листя салату — 10 г""",
                                KiloType.K_1700: """Сендвіч із сиром
Хліб цільнозерновий — 60 г
Сир твердий 20–25% — 30 г
Помідор або огірок — 50 г
Листя салату — 10 г""",
                            }
                        ),
                    ]
                ),
                MealType.DINNER: Meal(
                    mealType=MealType.DINNER,
                    answers=[
                        Answer(
                            imageSrc="images/thursday/dinner.jpg",
                            text={
                                KiloType.K_1300: """Варене яйце + овочеве рагу зі спаржею
Яйце — 1 шт. (50 г)
Рагу 250г (Квасоля 80г, все решта кількість приблизна, можна змінювати за своїм смаком)

Баклажан 80 г
квасоля 80 г
помідор 40 г
перець 40 г
морква 30 г
цибуля/часник, олія — 3 г
Приготування: баклажани нарізати, посолити і залишити на трішки, щоб вийшла гіркота. В казанок виложити квасолю, перець, цибулю, моркву, баклажани. Додати трішки олії і тушити 15хв. Додати помідори, посолити, поперчити. Тушкувати до готовності під закритою кришкою. В кінці додати часник.""",
                                KiloType.K_1500: """Варене яйце + овочеве рагу зі спаржею
Яйце — 1 шт. (50 г)
Рагу порція 280г (Квасоля 80г, все решта кількість приблизна, можна змінювати за своїм смаком)
Баклажан 80 г
квасоля 80 г
помідор 40 г
перець 40 г
морква 30 г
цибуля/часник, олія — 3 г
Приготування: баклажани нарізати, посолити і залишити на трішки, щоб вийшла гіркота. В казанок виложити квасолю, перець, цибулю, моркву, баклажани. Додати трішки олії і тушити 15хв. Додати помідори, посолити, поперчити. Тушкувати до готовності під закритою кришкою. В кінці додати часник.""",
                                KiloType.K_1700: """Варене яйце + овочеве рагу зі спаржею
Яйце — 1 шт. (50 г)
Рагу порція 300г (Квасоля 100г, все решта кількість приблизна, можна змінювати за своїм смаком)
Баклажан 100 г
квасоля 100 г
помідор 40 г
перець 40 г
морква 30 г
цибуля/часник, олія — 3 г
Приготування: баклажани нарізати, посолити і залишити на трішки, щоб вийшла гіркота. В казанок виложити квасолю, перець, цибулю, моркву, баклажани. Додати трішки олії і тушити 15хв. Додати помідори, посолити, поперчити. Тушкувати до готовності під закритою кришкою. В кінці додати часник.""",
                            }
                        ),
                    ]
                ),
            }
        ),
        WeekDay.FRIDAY: Day(
            dayType=WeekDay.FRIDAY,
            meals={
                MealType.BREAKFAST: Meal(
                    mealType=MealType.BREAKFAST,
                    answers=[
                        Answer(
                            imageSrc="images/friday/breakfast.jpg",
                            text={
                                KiloType.K_1300: """Гречка з овочами, яйцем і сиром
Гречка суха — 40 г
Масло вершкове — 5 г (1 ч.л.)
Яйце — 1 шт. (50 г)
Сир твердий 20–25% — 30 г
Овочі (перець, кабачок, броколі) — 150 г""",
                                KiloType.K_1500: """Гречка з овочами, яйцем і сиром
Гречка суха — 45 г
Масло вершкове — 5 г (1 ч.л.)
Яйце — 1 шт. (50 г)
Сир твердий 20–25% — 30 г
Овочі (перець, кабачок, броколі) — 150 г""",
                                KiloType.K_1700: """Гречка з овочами, яйцем і сиром
Гречка суха — 50 г
Масло вершкове — 5 г (1 ч.л.)
Яйце — 1 шт. (50 г)
Сир твердий 20–25% — 35 г
Овочі (перець, кабачок, броколі) — 150 г""",
                            }
                        ),
                    ]
                ),
                MealType.MORNING_SNACK: Meal(
                    mealType=MealType.MORNING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/friday/morning_snack.jpg",
                            text={
                                KiloType.K_1300: """Печінкові млинці (зменшена порція)
Куряча печінка — 80 г
Яйце — 1шт.
Молоко 1,5% — 30 мл
Борошно рисове — 15 г
Морква варена — 20 г
Сир твердий — 15 г
Сметана 10% — 15 г
Олія — 2 г
Приготування: морквинку відварити. Печінку,пропустити через м'ясорубку/чи подрібнити на блендері, додати 1 яйце, молоко, сіль , борошно. Премішати усе ретельно (можна тим же блендером). Обсмажувати млинці на АП сковорідці, чи змазавши сковорідку кількома краплями олії.
Начинка: моркву, часник ( можна без нього), твердий сир усе тремо на мілкій терці, додаємо сметану, порізану зелень, сіль, перець, перемішуємо. Можна накладати начинку на млинець і скручувати в трубочку, а можна зробити тортиком, перемазавши начинкою коржі.""",
                                KiloType.K_1500: """Печінкові млинці (зменшена порція)
Куряча печінка — 100 г
Яйце — 1шт.
Молоко 1,5% — 50 мл
Борошно рисове — 20 г
Морква варена — 30 г
Сир твердий — 20 г
Сметана 10% — 20 г
Олія — 2 г
Приготування: морквинку відварити. Печінку,пропустити через м'ясорубку/чи подрібнити на блендері, додати 1 яйце, молоко, сіль , борошно. Премішати усе ретельно (можна тим же блендером). Обсмажувати млинці на АП сковорідці, чи змазавши сковорідку кількома краплями олії.
Начинка: моркву, часник ( можна без нього), твердий сир усе тремо на мілкій терці, додаємо сметану, порізану зелень, сіль, перець, перемішуємо. Можна накладати начинку на млинець і скручувати в трубочку, а можна зробити тортиком, перемазавши начинкою коржі.""",
                                KiloType.K_1700: """Печінкові млинці (зменшена порція)
Куряча печінка — 100 г
Яйце — 1шт.
Молоко 1,5% — 50 мл
Борошно рисове — 20 г
Морква варена — 30 г
Сир твердий — 20 г
Сметана 10% — 20 г
Олія — 2 г
Приготування: морквинку відварити. Печінку,пропустити через м'ясорубку/чи подрібнити на блендері, додати 1 яйце, молоко, сіль , борошно. Премішати усе ретельно (можна тим же блендером). Обсмажувати млинці на АП сковорідці, чи змазавши сковорідку кількома краплями олії.
Начинка: моркву, часник ( можна без нього), твердий сир усе тремо на мілкій терці, додаємо сметану, порізану зелень, сіль, перець, перемішуємо. Можна накладати начинку на млинець і скручувати в трубочку, а можна зробити тортиком, перемазавши начинкою коржі.""",
                            }
                        ),
                        Answer(
                            imageSrc="images/friday/morning_snack_variant.jpg",
                            text={
                                KiloType.K_1300: """Тост з авокадо, яйцем і сиром
Хліб цільнозерновий — 30 г
Авокадо — 20 г
Яйце — 1 шт. (50 г)
Сир твердий — 15 г""",
                                KiloType.K_1500: """Тост з авокадо, яйцем і сиром
Хліб цільнозерновий — 35 г
Авокадо — 25 г
Яйце — 1 шт. (50 г)
Сир твердий — 20 г""",
                                KiloType.K_1700: """Тост з авокадо, яйцем і сиром
Хліб цільнозерновий — 40 г
Авокадо — 30 г
Яйце — 1 шт. (50 г)
Сир твердий — 25 г""",
                            }
                        ),
                    ]
                ),
                MealType.LUNCH: Meal(
                    mealType=MealType.LUNCH,
                    answers=[
                        Answer(
                            imageSrc="images/friday/lunch.jpg",
                            text={
                                KiloType.K_1300: """Овочевий салат (огірок, капуста, помідор) — 200 г
Олія — 5 г (1 ч.л.)

Котлета з тунця:
Тунець у власному соку (злитий) — 110г-120г
Яйце — 1 шт. 
Сир твердий — 15 г
Борошно рисове — 15 г
Олія для смаження — 2 г
Приготування: зливаємо з тунця всю рідину У мисці змішуємо розім'ятий сиделкою тунець, натертий сир, яйце і добре перемішуємо До отриманого фаршу додаємо борошно та спеції, і ще раз добре перемішуємо Мокрими руками формуємо котлети і обсмажуємо їх на краплі оливкової олії до золотистої скоринки.""",
                                KiloType.K_1500: """Овочевий салат (огірок, капуста, помідор) — 200 г
Олія — 5 г (1 ч.л.)

Котлета з тунця:
Тунець у власному соку (злитий) — 110 г-120г
Яйце —1 шт. 
Сир твердий — 20 г
Борошно рисове — 20 г
Олія для смаження — 3 г
Приготування: зливаємо з тунця всю рідину У мисці змішуємо розім'ятий сиделкою тунець, натертий сир, яйце і добре перемішуємо До отриманого фаршу додаємо борошно та спеції, і ще раз добре перемішуємо Мокрими руками формуємо котлети і обсмажуємо їх на краплі оливкової олії до золотистої скоринки.""",
                                KiloType.K_1700: """Овочевий салат (огірок, капуста, помідор) — 200 г
Олія — 5 г (1 ч.l.)

Котлета з тунця:
Тунець у власному соку (злитий) — 110 г-120г
Яйце —1 шт. 
Сир твердий — 25 г
Борошно рисове — 25 г
Олія для смаження — 3 г
Приготування: зливаємо з тунця всю рідину У мисці змішуємо розім'ятий сиделкою тунець, натертий сир, яйце і добре перемішуємо До отриманого фаршу додаємо борошно та спеції, і ще раз добре перемішуємо Мокрими руками формуємо котлети і обсмажуємо їх на краплі оливкової олії до золотистої скоринки.""",
                            }
                        ),
                    ]
                ),
                MealType.EVENING_SNACK: Meal(
                    mealType=MealType.EVENING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/friday/evening_snack.jpg",
                            text={
                                KiloType.K_1300: """Смузі з чорницею
Чорниця — 100 г
Йогурт 1,5% — 150 мл
Насіння льону — 5 г""",
                                KiloType.K_1500: """Смузі з чорницею
Чорниця — 100 г
Банан - 50г
Йогурт 1,5% — 150 мл
Насіння льону — 5 г""",
                                KiloType.K_1700: """Смузі з чорницею
Чорниця — 100 г
Банан - 80г
Йогурт 1,5% — 150 мл
Насіння льону — 5 г""",
                            }
                        ),
                    ]
                ),
                MealType.DINNER: Meal(
                    mealType=MealType.DINNER,
                    answers=[
                        Answer(
                            imageSrc="images/friday/dinner.jpg",
                            text={
                                KiloType.K_1300: """Риба запечена з овочами
Риба біла (хек/минтай) — 150г сирої
Овочі (морква, кабачок, помідори) — 300 г
Олія — 5 г (1 ч.л.)
Приготування: Філе риби натерти сіллю, перцем, спеціями, укласти в рукав. Крупно нарізати овочі, з’єднати з подрібненим часником, додавши лимонний сік і приправи. Покласти овочі поруч з рибою, зав’язати рукав. Відправити на 40 хв. в прогріту до 180 градусів духовку.""",
                                KiloType.K_1500: """Риба запечена з овочами
Риба біла (хек/минтай) — 165г сирої
Овочі (морква, кабачок, помідори) — 300 г
Олія — 5 г (1 ч.л.)
Приготування: Філе риби натерти сіллю, перцем, спеціями, укласти в рукав. Крупно нарізати овочі, з’єднати з подрібненим часником, додавши лимонний сік і приправи. Покласти овочі поруч з рибою, зав’язати рукав. Відправити на 40 хв. в прогріту до 180 градусів духовку.""",
                                KiloType.K_1700: """Риба запечена з овочами
Риба біла (хек/минтай) в сирому виді 200г 
Овочі (морква, кабачок, помідори) — 300 г
Олія — 5 г (1 ч.л.)
Приготування: Філе риби натерти сіллю, перцем, спеціями, укласти в рукав. Крупно нарізати овочі, з’єднати з подрібненим часником, додавши лимонний сік і приправи. Покласти овочі поруч з рибою, зав’язати рукав. Відправити на 40 хв. в прогріту до 180 градусів духовку.""",
                            }
                        ),
                    ]
                ),
            }
        ),
        WeekDay.SATURDAY: Day(
            dayType=WeekDay.SATURDAY,
            meals={
                MealType.BREAKFAST: Meal(
                    mealType=MealType.BREAKFAST,
                    answers=[
                        Answer(
                            imageSrc="images/saturday/breakfast.jpg",
                            text={
                                KiloType.K_1300: """Лаваш з творогом, яйцем і зеленню
Лаваш тонкий — 40 г
Творог 5% — 100 г
Яйце — 1 шт.
Зелень (кріп, петрушка) — 5–10 г
Йогурт 2% для подачі — 50 г
Зробити рулетом, підсмажити на сухій сковорідці.""",
                                KiloType.K_1500: """Лаваш з творогом, яйцем і зеленню
Лаваш тонкий — 50 г
Творог 5% — 100 г
Яйце — 1 шт.
Зелень (кріп, петрушка) — 5–10 г
Йогурт 2% для подачі — 50 г
Зробити рулетом, підсмажити на сухій сковорідці.""",
                                KiloType.K_1700: """Лаваш з творогом, яйцем і зеленню
Лаваш тонкий — 60 г
Tворог 5% — 120 г
Яйце — 1 шт.
Зелень (кріп, петрушка) — 5–10 г
Йогурт 2% для подачі — 70 г
Зробити рулетом, підсмажити на сухій сковорідці.""",
                            }
                        ),
                    ]
                ),
                MealType.MORNING_SNACK: Meal(
                    mealType=MealType.MORNING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/saturday/morning_snack.jpg",
                            text={
                                KiloType.K_1300: """Яблуко — 120 г
Арахісова паста (натуральна) — 10 г
Хлібець житній або гречаний — 1 шт. (8–10 г)""",
                                KiloType.K_1500: """Фрукти — 150 г
Арахісова паста (натуральна) — 10г
Хлібець житній або гречаний — 1 шт. (8–10 г)""",
                                KiloType.K_1700: """Фрукти — 150 г
Арахісова паста (натуральна) — 15г
Хлібець житній або гречаний — 20г""",
                            }
                        ),
                    ]
                ),
                MealType.LUNCH: Meal(
                    mealType=MealType.LUNCH,
                    answers=[
                        Answer(
                            imageSrc="images/saturday/lunch.jpg",
                            text={
                                KiloType.K_1300: """Ніжне філе з ароматом Італії
Куряче філе — 220 г (сире)
Помідори — 200 г
Оливки — 30 г
Сир твердий до 30% — 30 г
Італійські трави, сіль, перець
Приготування: викласти шарами й запікати 30–35 хв при 220°C.""",
                                KiloType.K_1500: """Ніжне філе з ароматом Італії
Куряче філе — 250 г (сире)
Помідори — 200 г
Оливки — 35 г
Сир твердий до 30% — 35 г
Італійські трави, сіль, перець
Приготування: викласти шарами й запікати 30–35 хв при 220°C.""",
                                KiloType.K_1700: """Ніжне філе з ароматом Італії
Куряче філе — 270 г (сире)
Помідори — 200 г
Оливки — 40 г
Сир твердий до 30% — 40 г
Італійські трави, сіль, перець
Приготування: викласти шарами й запікати 30–35 хв при 220°C.""",
                            }
                        ),
                    ]
                ),
                MealType.EVENING_SNACK: Meal(
                    mealType=MealType.EVENING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/saturday/evening_snack.jpg",
                            text={
                                KiloType.K_1300: """Кефір + галети
Кефір 2,5% — 200 мл
Галети/хлібці — 20 г""",
                                KiloType.K_1500: """Кефір + галети
Кефір 2,5% — 200 мл
Галети/хлібці — 20 г
Сир твердий - 10г""",
                                KiloType.K_1700: """Кефір + галети
Кефір 2,5% — 200 мл
Галети/хлібці — 25 г
Сир твердий - 15г""",
                            }
                        ),
                    ]
                ),
                MealType.DINNER: Meal(
                    mealType=MealType.DINNER,
                    answers=[
                        Answer(
                            imageSrc="images/saturday/dinner.jpg",
                            text={
                                KiloType.K_1300: """Теплий салат з квасолею
Інгредієнти:
Квасоля консервована (не в томаті) — 120 г
Печериці — 120 г
Цибуля — 50 г
Олія — 5 мл
Сіль, перець, зелень за бажанням
Приготування: печериці помити, обсушити, ріжемо слайсами, цибулю четверть кільцями, обсмажуємо гриби з цибулею на 5мл олії, солимо, перчимо за смаком, викладаємо у тарілку, додаємо квасолю, можна додати зелень за смаком, перемішуємо.""",
                                KiloType.K_1500: """Теплий салат з квасолею
Інгредієнти:
Квасоля консервована (не в томаті) — 130 г
Печериці — 130 г
Цибуля — 50 г
Олія — 5 мл
Сіль, перець, зелень за бажанням
Приготування: печериці помити, обсушити, ріжемо слайсами, цибулю четверть кільцями, обсмажуємо гриби з цибулею на 5мл олії, солимо, перчимо за смаком, викладаємо у тарілку, додаємо квасолю, можна додати зелень за смаком, перемішуємо.""",
                                KiloType.K_1700: """Теплий салат з квасолею
Інгредієнти:
Квасоля консервована (не в томаті) — 130 г
Печериці — 130 г
Огірок - 100г
Цибуля — 50 г
Олія — 5 мл
Сіль, перець, зелень за бажанням
Приготування: печериці помити, обсушити, ріжемо слайсами, цибулю четверть кільцями, обсмажуємо гриби з цибулею на 5мл олії, солимо, перчимо за смаком, викладаємо у тарілку, додаємо квасолю, можна додати зелень за смаком, перемішуємо.""",
                            }
                        ),
                    ]
                ),
            }
        ),
        WeekDay.SUNDAY: Day(
            dayType=WeekDay.SUNDAY,
            meals={
                MealType.BREAKFAST: Meal(
                    mealType=MealType.BREAKFAST,
                    answers=[
                        Answer(
                            imageSrc="images/sunday/breakfast.jpg",
                            text={
                                KiloType.K_1300: """Гречка з яйцем + бутерброд із творогом і зеленню
Гречка суха — 35 г
Яйце — 1 шт. (50 г)
Вершкове масло — 5 г
Творог 5% — 80 г
Хлібець житній — 1 шт. (10 г)
Зелень — 10 г
Огірок або помідор — 50 г
Творог змішати з зеленню, сіллю, викласти на хлібець. Подати з яйцем, кашею та овочами.""",
                                KiloType.K_1500: """Гречка з яйцем + бутерброд із творогом і зеленню
Гречка суха — 40 г
Яйце — 1 шт. (50 г)
Вершкове масло — 5 г
Творог 5% — 90 г
Хлібець житній — 15
Зелень — 10 г
Огірок або помідор — 50 г
Творог змішати з зеленню, сіллю, викласти на хлібець. Подати з яйцем, кашею та овочами.""",
                                KiloType.K_1700: """Гречка з яйцем + бутерброд із творогом і зеленню
Гречка суха — 45 г
Яйце — 1 шт. (50 г)
Вершкове масло — 5 г
Творог 5% — 100 г
Хлібець житній — 20
Зелень — 10 г
Огірок або помідор — 50 г
Творог змішати з зеленню, сіллю, викласти на хлібець. Подати з яйцем, кашею та овочами.""",
                            }
                        ),
                    ]
                ),
                MealType.MORNING_SNACK: Meal(
                    mealType=MealType.MORNING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/sunday/morning_snack.jpg",
                            text={
                                KiloType.K_1300: """Йогурт 2% — 150 г
Зефір — 1 шт. (≈20 г)""",
                                KiloType.K_1500: """Йогурт 2% — 150 г
Зефір — 1 шт. (≈20 г)
Горішки - 5г""",
                                KiloType.K_1700: """Йогурт 2% — 150 г
Зефір — 1 шт. (≈20 г)
Горішки - 5г-7г""",
                            }
                        ),
                    ]
                ),
                MealType.LUNCH: Meal(
                    mealType=MealType.LUNCH,
                    answers=[
                        Answer(
                            imageSrc="images/sunday/lunch.jpg",
                            text={
                                KiloType.K_1300: """Борщ червоний із курячим м’ясом
Куряче філе варене — 80 г (110г-115г сирого)
Капуста — 100 г
Буряк — 80 г
Морква — 30 г
Картопля — 50 г
Цибуля — 30 г
Томатна паста — 1 ч. л.
Олія — 5 г (для засмажки)
Зелень, спеції, часник — за смаком
Варити на курячому бульйоні, додати засмажку, зелень.""",
                                KiloType.K_1500: """Борщ червоний із курячим м’ясом
Куряче філе варене — 100 г (130г-135г сирого)
Капуста — 100 г
Буряк — 80 г
Морква — 30 г
Картопля — 50 г
Цибуля — 30 г
Томатна паста — 1 ч. л.
Олія — 5 г (для засмажки)
Зелень, спеції, часник — за смаком
Варити на курячому бульйоні, додати засмажку, зелень.""",
                                KiloType.K_1700: """Борщ червоний із курячим м’ясом
Куряче філе варене — 120 г (160г-170г сирого)
Капуста — 100 г
Буряк — 80 г
Морква — 30 г
Картопля — 50 г
Цибуля — 30 г
Томатна паста — 1 ч. л.
Олія — 5 г (для засмажки)
Зелень, спеції, часник — за смаком
Варити на курячому бульйоні, додати засмажку, зелень.""",
                            }
                        ),
                    ]
                ),
                MealType.EVENING_SNACK: Meal(
                    mealType=MealType.EVENING_SNACK,
                    answers=[
                        Answer(
                            imageSrc="images/sunday/evening_snack.jpg",
                            text={
                                KiloType.K_1300: """Творог 5% — 100 г
Малина свіжа або заморожена — 50 г""",
                                KiloType.K_1500: """Творог 5% — 100 г
Малина свіжа або заморожена — 70 г
Мед 5г""",
                                KiloType.K_1700: """Творог 5% — 120 г
Малина свіжа або заморожена — 90 г
Мед 5г""",
                            }
                        ),
                    ]
                ),
                MealType.DINNER: Meal(
                    mealType=MealType.DINNER,
                    answers=[
                        Answer(
                            imageSrc="images/sunday/dinner.jpg",
                            text={
                                KiloType.K_1300: """Куряче філе в апельсиновому соусі + гречка
Куряче філе — 150 г сирого
Апельсин — 100 г
Сік лимона — 5 мл
Зелена цибуля — 20 г
Олія — 2 г (для форми)
Приправи за смаком
Готуємо: філе натерти соком лимону, накрити й залишити на 20-30 хв.
Апельсин почистити та нарізати кубиками. Змішати апельсин з каррі, подрібненою зеленою цибулею, сіллю та перцем. У форму для запікання налити ложку води, викласти філе, а зверху викласти апельсинову масу. Запікати при температурі 200 градусів 25 хв
Гречка суха — 25 г
Запечене філе подати з гречкою.""",
                                KiloType.K_1500: """Куряче філе в апельсиновому соусі + гречка
Куряче філе — 170 г сирого
Апельсин — 100 г
Сік лимона — 5 мл
Зелена цибуля — 20 г
Олія — 2 г (для форми)
Приправи за смаком
Готуємо: філе натерти соком лимону, накрити й залишити на 20-30 хв.
Апельсин почистити та нарізати кубиками. Змішати апельсин з каррі, подрібненою зеленою цибулею, сіллю та перцем. У форму для запікання налити ложку води, викласти філе, а зверху викласти апельсинову масу. Запікати при температурі 200 градусів 25 хв
Гречка суха — 30 г
Запечене філе подати з гречкою.""",
                                KiloType.K_1700: """Гречка в сухому виді 35г

Куряче філе в апельсиновому соусі + гречка
Куряче філе — 200 г сирого
Апельсин — 120 г
Сік лимона — 5 мл
Зелена цибуля — 20 г
Олія — 2 г (для форми)
Приправи за смаком
Готуємо: філе натерти соком лимону, накрити й залишити на 20-30 хв.
Апельсин почистити та нарізати кубиками. Змішати апельсин з каррі, подрібненою зеленою цибулею, сіллю та перцем. У форму для запікання налити ложку води, викласти філе, а зверху викласти апельсинову масу. Запікати при температурі 200 градусів 25 хв
Гречка суха — 30 г
Запечене філе подати з гречкою.""",
                            }
                        ),
                    ]
                ),
            }
        ),
    }
)
